;Place localized text in this file

; Adjust 'Sniper Fire' to description to be less weapon specific (As Cannons now also use this)

[SniperStandardFire X2AbilityTemplate]
LocFriendlyName="Fire Setup Weapon"
LocHelpText="Fire your weapon at a target."
LocLongDescription="<Bullet/> Some weapons require a set-up time and always requires two actions to fire<br><Bullet/>Firing the primary weapon always ends a soldier's turn without special training.<br>"


; Conventional Weapons
[AssaultRifle_CV X2WeaponTemplate]
FriendlyName="Assault Rifle MkI"
FriendlyNamePlural="Assault Rifles"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/>This is the most basic of our standard issue small arms weapon. While capable of kicking out some heavy damage, its effectiveness falls off rapidly when faced with cover or armoured enemies.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[AssaultRifle_CV2 X2WeaponTemplate]
FriendlyName="Assault Rifle MKII"
FriendlyNamePlural="Assault Rifles"
BriefSummary=" Thanks to our advances in research, we are about to make a significant improvement on our basic, featuring greater damage, crit and capacity."
TacticalText="<Bullet/>This is an improved version of our standard issue small arms weapon. While capable of kicking out some heavy damage, its effectiveness falls off rapidly when faced with cover or armoured enemies.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[AssaultRifle_CV3 X2WeaponTemplate]
FriendlyName="Assault Rifle MKIII"
FriendlyNamePlural="Assault Rifles"
BriefSummary="Thanks to improvement in heat management, this model is capable of achieving much higher rates of fire than any of our previous assault rifles."
TacticalText="<Bullet/>This is a vastly improved version of our standard issue small arms weapon, capable of laying down a vast amount of firepower. While capable of kicking out some heavy damage, its effectiveness falls off rapidly when faced with cover or armoured enemies.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[AssaultRifle_CV4 X2WeaponTemplate]
FriendlyName="Assault Rifle MKIV"
FriendlyNamePlural="Assault Rifles"
BriefSummary="This is the most advanced weapon of this type we can achieve, featuring vastly improved overall combat capabilities."
TacticalText="<Bullet/>This is the best version of our standard issue small arms weapon, a very powerful small arms weapon. While capable of kicking out some heavy damage, its effectiveness falls off rapidly when faced with cover or armoured enemies.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[Cannon_CV X2WeaponTemplate]
FriendlyName="Cannon MkI"
FriendlyNamePlural="Cannons"
BriefSummary="Soldiers bringing our autocannons to the field trade off mobility for some serious long ranged firepower. Though they require some setup time, these weapons can lay down a withering hail of suppressing fire from beyond normal sight range. Thanks to advancements in cooling, we are able to ramp up the speed the barrels of this gun spin, allowing a much greater rate of fire."
TacticalText="<Bullet/>Our cannons provide long range fire support, providing suppressing fire beyond the range most enemies can retaliate.\n<Bullet/>Cannons always require both a soldier's actions to fire.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Cannon_CV2 X2WeaponTemplate]
FriendlyName="Cannon MKII"
FriendlyNamePlural="Cannons"
BriefSummary=" Upgrades in consturction means this model has greater ammo capacity and damage, allowing for greater fire support for more time."
TacticalText="<Bullet/>Our cannons provide long range fire support, providing suppressing fire beyond the range most enemies can retaliate.\n<Bullet/>Cannons always require both a soldier's actions to fire.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Cannon_CV3 X2WeaponTemplate]
FriendlyName="Cannon MKIII"
FriendlyNamePlural="Cannons"
BriefSummary="Thanks to advancements in cooling, we are able to ramp up the speed the barrels of this gun spin, allowing a much greater rate of fire, making our cannons even more deadly."
TacticalText="<Bullet/>Our cannons provide long range fire support, providing suppressing fire beyond the range most enemies can retaliate.\n<Bullet/>Cannons always require both a soldier's actions to fire.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Cannon_CV4 X2WeaponTemplate]
FriendlyName="Cannon MKIV"
FriendlyNamePlural="Cannons"
BriefSummary="This is the best conventional cannon we are capable of creating, an incredibly poweful infantry support weapon, capable of delivering a blistering hail of fire for extended periods of time."
TacticalText="<Bullet/>Our cannons provide long range fire support, providing suppressing fire beyond the range most enemies can retaliate.\n<Bullet/>Cannons always require both a soldier's actions to fire.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Shotgun_CV X2WeaponTemplate]
FriendlyName="Shotgun MkI"
FriendlyNamePlural="Shotguns"
BriefSummary="This is the most basic, gas propelled shotgun we have."
TacticalText="<Bullet/>Our basic shotguns are lighter than our standard rifles, offering a degree of mobility in the battlefield.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[Shotgun_CV2 X2WeaponTemplate]
FriendlyName="Shotgun MKII"
FriendlyNamePlural="Shotguns"
BriefSummary="Our upgraded shotguns deal more damage and have a larger clip."
TacticalText="<Bullet/>Our improved shotguns are lighter than our standard rifles, offering a degree of mobility in the battlefield.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/>Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[Shotgun_CV3 X2WeaponTemplate]
FriendlyName="Shotgun MKIII"
FriendlyNamePlural="Shotguns"
BriefSummary="While our cooling advancements may not allow our shotgun to fire any fast, they allow for the loading of a more volatile, therefore more dangerous payload."
TacticalText="<Bullet/>Our advanced shotguns are lighter than our standard rifles, offering a degree of mobility in the battlefield.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[Shotgun_CV4 X2WeaponTemplate]
FriendlyName="Shotgun MKIV"
FriendlyNamePlural="Shotguns"
BriefSummary="This is the most advanced weapon of this type we can achieve, featuring vastly improved overall combat capabilities."
TacticalText="<Bullet/>Our superior shotguns are lighter than our standard rifles, offering a degree of mobility in the battlefield.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[SniperRifle_CV X2WeaponTemplate]
FriendlyName="Sniper Rifle MkI"
FriendlyNamePlural="Sniper Rifles"
BriefSummary="Our sniper rifles provide long range damage support, along with the accuracy to pick targets off in cover. Though their slow rate of fire may mean they lack the stopping power of our other weapons, in the skilled hand, they can be deadly."
TacticalText="<Bullet/>The most basic sniper rifle. While they have a low base damage, sniper shots deal double damage on crits.\n<Bullet/>Sniper rifles fire AP rounds, nullifying a small portion of our enemies protection\n<Bullet/>Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[SniperRifle_CV2 X2WeaponTemplate]
FriendlyName="Sniper Rifle MKII"
FriendlyNamePlural="Sniper Rifles"
BriefSummary="Improvements in ballistic technology gives our snipers a bonus to damage and crit."
TacticalText="<Bullet/>An improved version of our sniper rifle. While they have a low base damage, sniper shots deal double damage on crits.\n<Bullet/>Sniper rifles fire AP rounds, nullifying a small portion of our enemies protection\n<Bullet/>Firing the primary weapon requires both the soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[SniperRifle_CV3 X2WeaponTemplate]
FriendlyName="Sniper Rifle MKIII"
FriendlyNamePlural="Sniper Rifles"
BriefSummary="Our improvements to cooling allows us to load heavier calibre rounds without compromising on accuracy, improving performance against enemy armor."
TacticalText="<Bullet/>A heavily upgraded sniper rifle. While they have a low base damage, sniper shots deal double damage on crits.\n<Bullet/>Sniper rifles fire AP rounds, nullifying a small portion of our enemies protection\n<Bullet/>Firing the primary weapon requires both the soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[SniperRifle_CV4 X2WeaponTemplate]
FriendlyName="Sniper Rifle MKIV"
FriendlyNamePlural="Sniper Rifles"
BriefSummary="This is the pinacle of ballistic sniper rifles, featuring improved stats across all fields."
TacticalText="<Bullet/>The most advanced ballistic sniper rifle, a truly lethal precision weapon. While they have a low base damage, sniper shots deal double damage on crits.\n<Bullet/>Sniper rifles fire AP rounds, nullifying a small portion of our enemies protection\n<Bullet/>Firing the primary weapon requires both the soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[Pistol_CV1 X2WeaponTemplate]
FriendlyName="Magnum MkI"
FriendlyNamePlural="Magnums"
BriefSummary="Made famous by our heroes of old, these somewhat archaic designed revolvers still pack one hell of a punch for a sidearm."
TacticalText="<Bullet/>Though not in the same league as our assault rifles, the Magnum is still a potent sidearm.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"

[Pistol_CV2 X2WeaponTemplate]
FriendlyName="Magnum MkII"
FriendlyNamePlural="Magnums"
BriefSummary="Our revolvers have received an upgrade to bring them into this century, increasing damage and crit."
TacticalText="<Bullet/>Though not in the same league as our assault rifles, the Magnum is still a potent sidearm.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"

[Pistol_CV3 X2WeaponTemplate]
FriendlyName="Magnum MkIII"
FriendlyNamePlural="Magnums"
BriefSummary="We continue to make improvements to our pistol designs, further improving damage."
TacticalText="<Bullet/>Though not in the same league as our assault rifles, the Magnum is still a potent sidearm.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"

[Pistol_CV4 X2WeaponTemplate]
FriendlyName="Magnum MkIV"
FriendlyNamePlural="Magnums"
BriefSummary="These are the apex of ballistic sidearms we can make."
TacticalText="<Bullet/>Though not in the same league as our assault rifles, the Magnum is still a potent sidearm.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"


;Magnetic Weapons

[AssaultRifle_MG X2WeaponTemplate]
FriendlyName="Rail Gun MkI"
FriendlyNamePlural="Rail Guns"
BriefSummary="Though highly inaccurate compared to its ADVENT counterpart, this weapon is capable of firing rounds at incredibly high velocity. Despite it not being likely to find use against enemy infantry, it may give our troops some form of answer to ADVENT's mechanized units."
TacticalText="<Bullet/>This is our first attempt at an infantry anti-armor weapon. Though highly inaccurate, it can punch through light enemy armor with ease.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[AssaultRifle_MG2 X2WeaponTemplate]
FriendlyName="Rail Gun MkII"
FriendlyNamePlural="Rail Guns"
BriefSummary="While we may not have been able to improve the accuracy of this weapon, we have managed to vastly improve the rail technology involved, allowing it to be even more deadly against armor."
TacticalText="<Bullet/>This is an improved infantry anti-armor weapon. Though highly inaccurate, it can punch through most enemy armor with ease.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[AssaultRifle_MG3 X2WeaponTemplate]
FriendlyName="Rail Gun MkIII"
FriendlyNamePlural="Rail Guns"
BriefSummary="This is the best rail gun we can build. Loaded with explosive submunitions, this weapon will tear through armor and cover with impunity."
TacticalText="<Bullet/>This is our best infantry anti-armor weapon. Though highly inaccurate, it can punch through almost any enemy armor with ease.\n<Bullet/>This weapon can devestate cover in addition to enemy armor.\n<Bullet/>Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[Cannon_MG X2WeaponTemplate]
FriendlyName="Magnetic Cannon MkI"
FriendlyNamePlural=" Mag Cannons"
BriefSummary="Coming in as our long range anti armor support, our mag cannons can deal immense damage to enemy mechanized units beyond the usual retaliation range."
TacticalText="<Bullet/>Coming in as our long range anti armor support, our basic mag cannons can deal immense damage to enemy mechanized units beyond the usual retaliation range.\n<Bullet/>Firing the cannon always requires both a soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Cannon_MG2 X2WeaponTemplate]
FriendlyName="Magnetic Cannon MkII"
FriendlyNamePlural=" Mag Cannons"
BriefSummary="Improvements to our mag cannon designs allow for a greater clip of armor piercing rounds fired at a higher velocity."
TacticalText="<Bullet/>Coming in as our long range anti armor support, our improved mag cannons can deal immense damage to enemy mechanized units beyond the usual retaliation range.\n<Bullet/>Firing the cannon always requires both a soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Cannon_MG3 X2WeaponTemplate]
FriendlyName="Magnetic Cannon MkIII"
FriendlyNamePlural=" Mag Cannons"
BriefSummary="These are the best mag cannons we can design, bring both anti-armor and anti-structure capabilities"
TacticalText="<Bullet/>Coming in as our long range anti armor support, our superior mag cannons can deal immense damage to enemy mechanized units beyond the usual retaliation range.\n<Bullet/>This weapon can devestate cover in addition to enemy armor.\n<Bullet/>Firing the cannon always requires both a soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Shotgun_MG X2WeaponTemplate]
FriendlyName="Flak Cannon MkI"
FriendlyNamePlural="Flak Cannons"
BriefSummary="Our Flak cannons take the traits of a shotgun even further, dealing even more damage but with even less care for accuracy."
TacticalText="<Bullet/>Our basic flak cannons can devestate most target types at point blank range.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[Shotgun_MG2 X2WeaponTemplate]
FriendlyName="Flak Cannon MkII"
FriendlyNamePlural="Flak Cannons"
BriefSummary="Our improved Flak Cannons feature a bonus to damage, pierce and shred"
TacticalText="<Bullet/>Our improved flak cannons can devestate most target types at point blank range.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[Shotgun_MG3 X2WeaponTemplate]
FriendlyName="Flak Cannon MkIII"
FriendlyNamePlural="Flak Cannons"
BriefSummary="Featuring the same submunitions all our advanced magnetic weapons have, our best Flak cannons will chew though enemy armor and cover with equal ease at close range."
TacticalText="<Bullet/>Our best flak cannons can devestate most target types at point blank range.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/>This weapon can devestate cover in addition to enemy armor.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[SniperRifle_MG X2WeaponTemplate]
FriendlyName="Anti Material Rifle MkI"
FriendlyNamePlural="Anti Material Rifles"
BriefSummary="Our anti material rifles strip out all other features to allow for that single, devestating shot."
TacticalText="<Bullet/>The anti material rifle deals devestating damage at long ranges, but only carries a single shot.\n<Bullet/>Firing the primary weapon requires both the soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[SniperRifle_MG2 X2WeaponTemplate]
FriendlyName="Anti Material Rifle MkII"
FriendlyNamePlural="Anti Material Rifles"
BriefSummary="Improvements in design allow our anti material rifles to fire an even deadlier shot."
TacticalText="<Bullet/>The anti material rifle deals devestating damage at long ranges, but only carries a single shot.\n<Bullet/>Firing the primary weapon requires both the soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[SniperRifle_MG3 X2WeaponTemplate]
FriendlyName="Anti Material Rifle MkIII"
FriendlyNamePlural="Anti Material Rifles"
BriefSummary="Our best anti material rifles fire a devestating submunition, nullify all but the greatest of enemy protections."
TacticalText="<Bullet/>The anti material rifle deals devestating damage at long ranges, but only carries a single shot.\n<Bullet/>Firing the primary weapon requires both the soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[Pistol_MG1 X2WeaponTemplate]
FriendlyName="Bolt Pistol MkI"
FriendlyNamePlural="Bolt Pistols"
BriefSummary="Though wildly inaccurate, Teigen's bolt pistols fire an impressively large round, capable of creating a sizeable hole in most objects."
TacticalText="<Bullet/>Our bolt pistols fire a very dense round at a short range, to devestating effect on any target it hits.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"

[Pistol_MG2 X2WeaponTemplate]
FriendlyName="Bolt Pistol MkII"
FriendlyNamePlural="Bolt Pistols"
BriefSummary="Bigger rail, bigger shot. Still can't hit much, but what it does hit, it hurts."
TacticalText="<Bullet/>Though not in the same league as our assault rifles, the Magnum is still a potent sidearm.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"

[Pistol_MG3 X2WeaponTemplate]
FriendlyName="Bolt Pistol MkIII"
FriendlyNamePlural="Bolt Pistols"
BriefSummary="We continue to make improvements to our pistol designs, further improving damage."
TacticalText="<Bullet/>Though not in the same league as our assault rifles, the Magnum is still a potent sidearm.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"


;Plasma Weapons

[AssaultRifle_BM X2WeaponTemplate]
FriendlyName="Plasma Gun MkI"
FriendlyNamePlural="Plasma Guns"
BriefSummary="Based on alien designs, this weapon provides a highly voliatile charged shot, that will permanently damage enemy armor."
TacticalText="<Bullet/>Plasma guns can shred enemy armor permanently, leaving them vulnerable to follow up damage.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[AssaultRifle_BM2 X2WeaponTemplate]
FriendlyName="Plasma Gun MkII"
FriendlyNamePlural="Plasma Guns"
BriefSummary="Our improved plasma guns feature greater damage, shred and crit."
TacticalText="<Bullet/>Plasma guns can shred enemy armor permanently, leaving them vulnerable to follow up damage.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[AssaultRifle_BM3 X2WeaponTemplate]
FriendlyName="Plasma Gun MkIII"
FriendlyNamePlural="Plasma Guns"
BriefSummary="Our best plasma guns feature the best damage capacity and shred we can manage."
TacticalText="<Bullet/>Plasma guns can shred enemy armor permanently, leaving them vulnerable to follow up damage.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"

[Cannon_BM X2WeaponTemplate]
FriendlyName="Plasma Cannon MkI"
FriendlyNamePlural="Plasma Cannons"
BriefSummary="Our plasma cannons sacrifice clip size in favour of devestating salvos that destroy enemy armour and infantry alike."
TacticalText="<Bullet/>Our plasma cannons can deal massive damage and shed enemy armor from a long range.\n<Bullet/>Firing the cannon always requires both a soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Cannon_BM2 X2WeaponTemplate]
FriendlyName="Plasma Cannon MkII"
FriendlyNamePlural="Plasma Cannons"
BriefSummary="Our improved design on the plasma cannon brings more damage and shred to the field."
TacticalText="<Bullet/>Our plasma cannons can deal massive damage and shed enemy armor from a long range.\n<Bullet/>Firing the cannon always requires both a soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Cannon_BM3 X2WeaponTemplate]
FriendlyName="Plasma Cannon MkIII"
FriendlyNamePlural="Plasma Cannons"
BriefSummary="Our best plasma cannons will destroy most enemy targets with ease."
TacticalText="<Bullet/>Our plasma cannons can deal massive damage and shed enemy armor from a long range.\n<Bullet/>Firing the cannon always requires both a soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Shotgun_BM X2WeaponTemplate]
FriendlyName="Plasma Shotgun MkI"
FriendlyNamePlural="Plasma Shotguns"
BriefSummary="Our plasma shotguns are more effective at longer ranges than most of our shotguns, whilst touting some strong armor shredding properties."
TacticalText="<Bullet/>Our plasma shotguns have less damage potential than our conventional models, but can fire further.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[Shotgun_BM2 X2WeaponTemplate]
FriendlyName="Plasma Shotgun MkII"
FriendlyNamePlural="Plasma Shotguns"
BriefSummary="Improvements to our plasma shotguns allows them to deal more damage and carry a larger clip."
TacticalText="<Bullet/>Our plasma shotguns have less damage potential than our conventional models, but can fire further.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[Shotgun_BM3 X2WeaponTemplate]
FriendlyName="Plasma Shotgun MkIII"
FriendlyNamePlural="Plasma Shotguns"
BriefSummary="Our best plasma shotguns are truly formidable short-mid range weapons, with higher damage and shred."
TacticalText="<Bullet/>Our plasma shotguns have less damage potential than our conventional models, but can fire further.\n<Bullet/>Shotguns are devastating up close, but nigh on useless at longer ranges.\n<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Shotgun's tactical effectiveness."
AbilityDescName="shotgun"

[SniperRifle_BM X2WeaponTemplate]
FriendlyName="Plasma Lance MkI"
FriendlyNamePlural="Plasma Lances"
BriefSummary="Our Plasma Lances sacrifice an element of damage to gain some accuracy, whilst retaining their innate armor shredding."
TacticalText="<Bullet/>The plasma lance is deadly against armoured targets from a long range.\n<Bullet/>Firing the primary weapon requires both the soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[SniperRifle_BM2 X2WeaponTemplate]
FriendlyName="Plasma Lance MkII"
FriendlyNamePlural="Plasma Lances"
BriefSummary="Our improved Plasma Lances boast greater damage and clip size."
TacticalText="<Bullet/>The plasma lance is deadly against armoured targets from a long range.\n<Bullet/>Firing the primary weapon requires both the soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[SniperRifle_BM3 X2WeaponTemplate]
FriendlyName="Plasma Lance MkIII"
FriendlyNamePlural="Plasma Lances"
BriefSummary="These are the best overall plasma lances we can build."
TacticalText="<Bullet/>The plasma lance is deadly against armoured targets from a long range.\n<Bullet/>Firing the primary weapon requires both the soldier's actions.\n<Bullet/> Use upgrades looted from enemies to improve the Sniper Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[Pistol_BM1 X2WeaponTemplate]
FriendlyName="Plasma Pistol MkI"
FriendlyNamePlural="Plasma Pistols"
BriefSummary="This weapon features all the armor melting goodness of the alien weapons on a smaller frame."
TacticalText="<Bullet/>Our plasma pistols can shred armor very effectively, making them ideal for softening up tougher targets.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"

[Pistol_BM2 X2WeaponTemplate]
FriendlyName="Plasma Pistol MkII"
FriendlyNamePlural="Plasma Pistols"
BriefSummary="We've managed to improve the design of our plasma pistols, increasing their damage."
TacticalText="<Bullet/>Our plasma pistols can shred armor very effectively, making them ideal for softening up tougher targets.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"

[Pistol_BM3 X2WeaponTemplate]
FriendlyName="Plasma Pistol MkIII"
FriendlyNamePlural="Plasma Pistols"
BriefSummary="We continue to make improvements to our pistol designs, further improving damage."
TacticalText="<Bullet/>Our plasma pistols can shred armor very effectively, making them ideal for softening up tougher targets.\n<Bullet/> Firing the pistol weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Magnum's tactical effectiveness."
AbilityDescName="pistol"

;Techs

[Conventional_T2 X2TechTemplate]
DisplayName="Advanced Ballistics"
Summary="Though considered formidable weapons prior to the alien occupation, our current firearms come up somewhat lacklustre compared to the standard weapons equipped by ADVENT's soldiers. If we are able to collect some samples of these ADVENT weapons for study, we may be able to do reverse engineering to improve our ballistic weapons."
CodeName="Scar"

[Conventional_T3 X2TechTemplate]
DisplayName="Cooling Solutions"
Summary="We've noticed the Advent Captain's target marker kicks out some serious heat. In order for them to still utilise these as standard rifles, the cooling mechanisms in that weapon must be impressive. If we can get a few of them and crack them open, we may be able to unravel the technology used and achieve much higher rates of fire on our ballistic weapons without risk of overheating."
CodeName="Dakka Dakka"

[Conventional_T4 X2TechTemplate]
DisplayName="Armory Refinement"
Summary="We've learnt much in our time fighting the alien forces, and seeing their technology first hand. With that in mind, provided we have some samples of their somewhat larger ballistic weapons, Shen & Teigen believe that with time and resources, we could create a cadre of truly formidable ballistic weapons."
CodeName="Deadpoint"

[Magnetic_T1 X2TechTemplate]
DisplayName="Magnetic Weapons"
Summary="While our conventional weapons are capable of enaging enemy infantry, the ADVENT mechanised units are proving to be a much more menacing prospect. Teigen believes, that if we can gather enough samples of ADVENT magnetic weapons, we could potentially reverse engineer something that could give us an edge against enemy armor."
CodeName="Kraken"

[Magnetic_T2 X2TechTemplate]
DisplayName="Rail Extensions"
Summary="As much as our anti-armor arsenal has been put to good use in the field, ADVENT are fielding ever more advanced armored units. With the help of shen, we believe a redesign of our arsenal could allow for a longer central rail on most of our mag weapons, leading to a much higher muzzle velocity bduring fire."
CodeName="Jackhammer"

[Magnetic_T3 X2TechTemplate]
DisplayName="Advanced Submunitions"
Summary="Through advancements in our elerium studies, one of our team theorised we could build some quite potent, elerium based subminutions that could be loaded into our mag weapons. This should open up a whole new level of anti armor capabilities, and possibly even allow them to deal with enemy structures."
CodeName="Scorpion Sting"

[Plasma_T1 X2TechTemplate]
DisplayName="Plasma Weapons"
Summary="Even since the days of the old war, our true enemy has employed lethal plasma weapons against us, however due to their triggered self destruct upon the wielder's demise, we've never had the chance to have a look at these weapons. Thankfully, since the days of ADVENT, the aliens have become more lax with the security in which they keep these weapons secret. Our science team seems particularly interested in the nature of how these weapons eat through armor, and want to see if this feature can be adapted to our own line of weapons."
CodeName="Trojan"

[Plasma_T2 X2TechTemplate]
DisplayName="Destabilzed Payload"
Summary="Now the enemy is fielding more advanced plasma weapons, we should be able to accquire some of these to study ourselves. If we can see how they manage the extraordinary power flux contained in these weapons, perhaps we could adapt our armory to fire a more caustic payload."
CodeName="Enigma"

[Plasma_T3 X2TechTemplate]
DisplayName="Refined Elerium Weapon Cores"
Summary="Thanks to our greater understanding of elerium, we can now integrate certain elements of this into our weapons technology. This is of particular value to our Plasma weapons, which fundamentally rely upon the substance in order to function."
CodeName="Area 51"